## Data ingestion

In [62]:
#importación de librerías
import pandas as pd
import numpy as np

In [63]:
### Cargar tablas de datos desde github ###
retirement_info ='https://raw.githubusercontent.com/jhansanchez/casome/main/datos/retirement_info.csv'
general_data= 'https://raw.githubusercontent.com/jhansanchez/casome/main/datos/general_data.csv'
employee_survey_data ='https://raw.githubusercontent.com/jhansanchez/casome/main/datos/employee_survey_data.csv'
out_time = 'https://raw.githubusercontent.com/jhansanchez/casome/main/datos/out_time.csv'
in_time = 'https://raw.githubusercontent.com/jhansanchez/casome/main/datos/in_time.csv'
manager_survey_data ='https://raw.githubusercontent.com/jhansanchez/casome/main/datos/manager_survey_data.csv'

In [100]:
df_general = pd.read_csv(general_data) # datos generales de los empleados
df_manager_s = pd.read_csv(manager_survey_data) #encuesta del gerente de desempeño de los empleados
df_retirement = pd.read_csv(retirement_info) # información de empleados que se retiran de la empresa
df_employee_s = pd.read_csv(employee_survey_data) # encuesta de los empleados nivel de satisfacción laboral
df_in= pd.read_csv(in_time) # el horario de ingreso de cada empleado
df_out= pd.read_csv(out_time) # el horario de salida de cada empleado

In [65]:
df_manager_s.head(5)

   EmployeeID  JobInvolvement  PerformanceRating
0           1               3                  3
1           2               2                  4
2           3               3                  3
3           4               2                  3
4           5               3                  3

In [66]:
df_employee_s.head(5)

   EmployeeID  EnvironmentSatisfaction  JobSatisfaction  WorkLifeBalance
0           1                      3.0              4.0              2.0
1           2                      3.0              2.0              4.0
2           3                      2.0              2.0              1.0
3           4                      4.0              4.0              3.0
4           5                      4.0              1.0              3.0

In [67]:
df_general.head(5)

,Age,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeID,Gender,JobLevel,...,NumCompaniesWorked,Over18,PercentSalaryHike,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager
0,51,Travel_Rarely,Sales,6,2,Life Sciences,1,1,Female,1,...,1.0,Y,11,8,0,1.0,6,1,0,0
1,31,Travel_Frequently,Research & Development,10,1,Life Sciences,1,2,Female,1,...,0.0,Y,23,8,1,6.0,3,5,1,4
2,32,Travel_Frequently,Research & Development,17,4,Other,1,3,Male,4,...,1.0,Y,15,8,3,5.0,2,5,0,3
3,38,Non-Travel,Research & Development,2,5,Life Sciences,1,4,Male,3,...,3.0,Y,11,8,3,13.0,5,8,7,5
4,32,Travel_Rarely,Research & Development,10,1,Medical,1,5,Male,1,...,4.0,Y,12,8,2,9.0,2,6,0,4

In [106]:
df_general['StandardHours'].value_counts()

8    4410
Name: StandardHours, dtype: int64

In [68]:
df_retirement.head(5)

   EmployeeID Attrition retirementDate retirementType resignationReason
0           2       Yes     15/10/2016    Resignation            Others
1           7       Yes      20/7/2016    Resignation            Stress
2          14       Yes      8/11/2016    Resignation            Others
3          29       Yes     15/10/2016    Resignation            Others
4          31       Yes       8/2/2016    Resignation            Salary

In [104]:
df_in

,Unnamed: 0,1/1/2015,2/1/2015,5/1/2015,6/1/2015,7/1/2015,8/1/2015,9/1/2015,12/1/2015,13/1/2015,...,18/12/2015,21/12/2015,22/12/2015,23/12/2015,24/12/2015,25/12/2015,28/12/2015,29/12/2015,30/12/2015,31/12/2015
0,1,NaN,1/2/15 9:43,1/5/15 10:08,1/6/15 9:54,1/7/15 9:34,1/8/15 9:51,1/9/15 10:09,1/12/15 9:42,1/13/15 10:13,...,NaN,12/21/15 9:55,12/22/15 10:04,12/23/15 10:14,12/24/15 10:11,NaN,12/28/15 10:13,12/29/15 10:03,12/30/15 9:54,12/31/15 10:12
1,2,NaN,1/2/15 10:15,1/5/15 10:21,NaN,1/7/15 9:45,1/8/15 10:09,1/9/15 9:43,1/12/15 10:00,1/13/15 10:43,...,12/18/15 10:37,12/21/15 9:49,12/22/15 10:33,12/23/15 10:12,NaN,NaN,12/28/15 9:31,12/29/15 9:55,12/30/15 10:32,12/31/15 9:27
2,3,NaN,1/2/15 10:17,1/5/15 9:50,1/6/15 10:14,1/7/15 9:47,1/8/15 10:03,1/9/15 10:05,1/12/15 10:03,1/13/15 10:21,...,12/18/15 10:15,12/21/15 10:10,12/22/15 9:44,12/23/15 10:15,12/24/15 10:07,NaN,12/28/15 9:42,12/29/15 9:43,12/30/15 9:34,12/31/15 10:28
3,4,NaN,1/2/15 10:05,1/5/15 9:56,1/6/15 10:11,1/7/15 9:37,1/8/15 10:02,1/9/15 10:08,1/12/15 10:13,1/13/15 9:53,...,12/18/15 10:17,12/21/15 9:58,12/22/15 10:04,12/23/15 10:11,12/24/15 9:43,NaN,12/28/15 9:52,12/29/15 9:33,12/30/15 10:18,12/31/15 10:01
4,5,NaN,1/2/15 10:28,1/5/15 9:49,1/6/15 9:45,1/7/15 9:49,1/8/15 10:19,1/9/15 10:00,1/12/15 10:29,1/13/15 9:59,...,12/18/15 9:58,12/21/15 10:03,12/22/15 10:10,12/23/15 10:13,12/24/15 9:44,NaN,12/28/15 10:05,12/29/15 10:30,12/30/15 9:18,12/31/15 9:41
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4405,4406,NaN,1/2/15 9:20,1/5/15 10:17,1/6/15 10:26,1/7/15 10:06,1/8/15 9:45,1/9/15 9:49,1/12/15 9:37,1/13/15 9:25,...,12/18/15 10:01,12/21/15 10:25,12/22/15 10:16,12/23/15 10:04,12/24/15 9:45,NaN,12/28/15 10:15,12/29/15 10:10,12/30/15 9:28,12/31/15 10:00
4406,4407,NaN,1/2/15 10:03,NaN,1/6/15 9:44,1/7/15 9:42,1/8/15 10:00,1/9/15 9:44,1/12/15 10:07,1/13/15 10:05,...,12/18/15 9:27,12/21/15 9:41,12/22/15 9:50,12/23/15 10:32,12/24/15 9:47,NaN,12/28/15 9:54,12/29/15 10:13,12/30/15 10:21,12/31/15 10:09
4407,4408,NaN,1/2/15 10:01,1/5/15 9:33,1/6/15 9:49,1/7/15 10:28,1/8/15 9:47,1/9/15 10:01,1/12/15 9:49,1/13/15 9:47,...,12/18/15 10:00,12/21/15 9:51,12/22/15 10:02,12/23/15 9:58,12/24/15 9:56,NaN,12/28/15 9:59,NaN,12/30/15 10:02,12/31/15 10:03
4408,4409,NaN,1/2/15 10:17,1/5/15 10:02,1/6/15 10:12,1/7/15 10:12,1/8/15 9:42,NaN,1/12/15 10:00,1/13/15 9:48,...,12/18/15 9:54,12/21/15 10:01,12/22/15 10:10,12/23/15 9:42,12/24/15 9:56,NaN,12/28/15 9:55,12/29/15 9:54,12/30/15 10:15,12/31/15 9:56
4409,4410,NaN,1/2/15 9:59,1/5/15 10:16,1/6/15 9:52,1/7/15 9:43,1/8/15 10:06,1/9/15 10:27,1/12/15 9:47,1/13/15 9:30,...,12/18/15 10:20,12/21/15 10:26,NaN,12/23/15 9:53,12/24/15 9:42,NaN,12/28/15 9:41,12/29/15 10:05,12/30/15 10:32,12/31/15 10:09

In [102]:
df_out.head(5)

,Unnamed: 0,2015-01-01,2015-01-02,2015-01-05,2015-01-06,2015-01-07,2015-01-08,2015-01-09,2015-01-12,2015-01-13,...,2015-12-18,2015-12-21,2015-12-22,2015-12-23,2015-12-24,2015-12-25,2015-12-28,2015-12-29,2015-12-30,2015-12-31
0,1,NaN,2015-01-02 16:56:15,2015-01-05 17:20:11,2015-01-06 17:19:05,2015-01-07 16:34:55,2015-01-08 17:08:32,2015-01-09 17:38:29,2015-01-12 16:58:39,2015-01-13 18:02:58,...,NaN,2015-12-21 17:15:50,2015-12-22 17:27:51,2015-12-23 16:44:44,2015-12-24 17:47:22,NaN,2015-12-28 18:00:07,2015-12-29 17:22:30,2015-12-30 17:40:56,2015-12-31 17:17:33
1,2,NaN,2015-01-02 18:22:17,2015-01-05 17:48:22,NaN,2015-01-07 17:09:06,2015-01-08 17:34:04,2015-01-09 16:52:29,2015-01-12 17:36:48,2015-01-13 18:00:13,...,2015-12-18 18:31:28,2015-12-21 17:34:16,2015-12-22 18:16:35,2015-12-23 17:38:18,NaN,NaN,2015-12-28 17:08:38,2015-12-29 17:54:46,2015-12-30 18:31:35,2015-12-31 17:40:58
2,3,NaN,2015-01-02 16:59:14,2015-01-05 17:06:46,2015-01-06 16:38:32,2015-01-07 16:33:21,2015-01-08 17:24:22,2015-01-09 16:57:30,2015-01-12 17:28:54,2015-01-13 17:21:25,...,2015-12-18 17:02:23,2015-12-21 17:20:17,2015-12-22 16:32:50,2015-12-23 16:59:43,2015-12-24 16:58:25,NaN,2015-12-28 16:43:31,2015-12-29 17:09:56,2015-12-30 17:06:25,2015-12-31 17:15:50
3,4,NaN,2015-01-02 17:25:24,2015-01-05 17:14:03,2015-01-06 17:07:42,2015-01-07 16:32:40,2015-01-08 16:53:11,2015-01-09 17:19:47,2015-01-12 17:13:37,2015-01-13 17:11:45,...,2015-12-18 17:55:23,2015-12-21 16:49:09,2015-12-22 17:24:00,2015-12-23 17:36:35,2015-12-24 16:48:21,NaN,2015-12-28 17:19:34,2015-12-29 16:58:16,2015-12-30 17:40:11,2015-12-31 17:09:14
4,5,NaN,2015-01-02 18:31:37,2015-01-05 17:49:15,2015-01-06 17:26:25,2015-01-07 17:37:59,2015-01-08 17:59:28,2015-01-09 17:44:08,2015-01-12 18:51:21,2015-01-13 18:14:58,...,2015-12-18 17:52:48,2015-12-21 17:43:35,2015-12-22 18:07:57,2015-12-23 18:00:49,2015-12-24 17:59:22,NaN,2015-12-28 17:44:59,2015-12-29 18:47:00,2015-12-30 17:15:33,2015-12-31 17:42:14

## Comprensión y limpieza de datos

En este sección de exploran las bases de datos, se verifican datos nulos y se asigna el tipo de dato correcto para cada variable.

1. Exploración de tipo de datos, nulos, información de variables

In [108]:
df_general.info() # solo hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 23 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4410 non-null   int64
 1   BusinessTravel           4410 non-null   object
 2   Department               4410 non-null   object
 3   DistanceFromHome         4410 non-null   int64
 4   Education                4410 non-null   int64
 5   EducationField           4410 non-null   object
 6   EmployeeCount            4410 non-null   int64
 7   EmployeeID               4410 non-null   int64
 8   Gender                   4410 non-null   object
 9   JobLevel                 4410 non-null   int64
 10  JobRole                  4410 non-null   object
 11  MaritalStatus            4410 non-null   object
 12  MonthlyIncome            4410 non-null   int64
 13  NumCompaniesWorked       4391 non-null   float64
 14  Over18                   4410 non-null   object
 15  PercentSalaryHike        4410 non-null   int64
 16  StandardHours            4410 non-null   int64
 17  StockOptionLevel         4410 non-null   int64
 18  TotalWorkingYears        4401 non-null   float64
 19  TrainingTimesLastYear    4410 non-null   int64
 20  YearsAtCompany           4410 non-null   int64
 21  YearsSinceLastPromotion  4410 non-null   int64
 22  YearsWithCurrManager     4410 non-null   int64
dtypes: float64(2), int64(14), object(7)
memory usage: 792.5+ KB

In [72]:
df_manager_s.info() # no hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         4410 non-null   int64
 1   JobInvolvement     4410 non-null   int64
 2   PerformanceRating  4410 non-null   int64
dtypes: int64(3)
memory usage: 103.5 KB

In [73]:
df_employee_s.info() # hay nulos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EmployeeID               4410 non-null   int64
 1   EnvironmentSatisfaction  4385 non-null   float64
 2   JobSatisfaction          4390 non-null   float64
 3   WorkLifeBalance          4372 non-null   float64
dtypes: float64(3), int64(1)
memory usage: 137.9 KB

In [74]:
df_retirement.info() # si hay nulos, pero solo en las razones de la renuncia

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 711 entries, 0 to 710
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         711 non-null    int64
 1   Attrition          711 non-null    object
 2   retirementDate     711 non-null    object
 3   retirementType     711 non-null    object
 4   resignationReason  641 non-null    object
dtypes: int64(1), object(4)
memory usage: 27.9+ KB

In [75]:
#df_in.isnull().sum()# si hay nulos

In [76]:
#df_out.isnull().sum() # hay nulos

In [77]:
lista = [ 'Attrition', 'retirementType','resignationReason']
for i in lista:
    print(i)
    print(df_retirement[i].unique())
    print('______________________________________________________')

Attrition
['Yes']
______________________________________________________
retirementType
['Resignation' 'Fired']
______________________________________________________
resignationReason
['Others' 'Stress' 'Salary' nan]
______________________________________________________

In [78]:
lista = [ 'Attrition', 'retirementType','resignationReason']
for i in lista:
    print(i)
    print(df_retirement[i].value_counts())
    print('______________________________________________________')

Attrition
Yes    711
Name: Attrition, dtype: int64
______________________________________________________
retirementType
Resignation    641
Fired           70
Name: retirementType, dtype: int64
______________________________________________________
resignationReason
Others    323
Salary    189
Stress    129
Name: resignationReason, dtype: int64
______________________________________________________

2. Modificaciones a la base de datos generales de los empleados (eliminación datos nulos y cambio de tipo de variable)

In [79]:
obj = (df_general.dtypes == object) #Filtrar variables categóricas
obj_cols = [c for c in obj.index if obj[c]] 
df_general_obj = df_general[obj_cols]
df_general_obj.head(5)

,BusinessTravel,Department,EducationField,Gender,JobRole,MaritalStatus,Over18
0,Travel_Rarely,Sales,Life Sciences,Female,Healthcare Representative,Married,Y
1,Travel_Frequently,Research & Development,Life Sciences,Female,Research Scientist,Single,Y
2,Travel_Frequently,Research & Development,Other,Male,Sales Executive,Married,Y
3,Non-Travel,Research & Development,Life Sciences,Male,Human Resources,Married,Y
4,Travel_Rarely,Research & Development,Medical,Male,Sales Executive,Single,Y

In [80]:
lista = df_general_obj.columns
for i in lista:
    print(i)
    print(df_general[i].value_counts())
    print('______________________________________________________')

BusinessTravel
Travel_Rarely        3129
Travel_Frequently     831
Non-Travel            450
Name: BusinessTravel, dtype: int64
______________________________________________________
Department
Research & Development    2883
Sales                     1338
Human Resources            189
Name: Department, dtype: int64
______________________________________________________
EducationField
Life Sciences       1818
Medical             1392
Marketing            477
Technical Degree     396
Other                246
Human Resources       81
Name: EducationField, dtype: int64
______________________________________________________
Gender
Male      2646
Female    1764
Name: Gender, dtype: int64
______________________________________________________
JobRole
Sales Executive              978
Research Scientist           876
Laboratory Technician        777
Manufacturing Director       435
Healthcare Representative    393
Manager                      306
Sales Representative         249
Research Director            240
Human Resources              156
Name: JobRole, dtype: int64
______________________________________________________
MaritalStatus
Married     2019
Single      1410
Divorced     981
Name: MaritalStatus, dtype: int64
______________________________________________________
Over18
Y    4410
Name: Over18, dtype: int64
______________________________________________________

In [81]:
lista = [ 'JobRole', 'MaritalStatus']
for i in lista:
    print(i)
    print(df_general_obj[i].value_counts())
    print('______________________________________________________')

JobRole
Sales Executive              978
Research Scientist           876
Laboratory Technician        777
Manufacturing Director       435
Healthcare Representative    393
Manager                      306
Sales Representative         249
Research Director            240
Human Resources              156
Name: JobRole, dtype: int64
______________________________________________________
MaritalStatus
Married     2019
Single      1410
Divorced     981
Name: MaritalStatus, dtype: int64
______________________________________________________

In [82]:
df_general.columns

Index(['Age', 'BusinessTravel', 'Department', 'DistanceFromHome', 'Education',
       'EducationField', 'EmployeeCount', 'EmployeeID', 'Gender', 'JobLevel',
       'JobRole', 'MaritalStatus', 'MonthlyIncome', 'NumCompaniesWorked',
       'Over18', 'PercentSalaryHike', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'YearsAtCompany',
       'YearsSinceLastPromotion', 'YearsWithCurrManager'],
      dtype='object')

In [83]:
df_general['EmployeeCount'].value_counts()

1    4410
Name: EmployeeCount, dtype: int64

In [84]:
df_general['StockOptionLevel'].value_counts()

0    1893
1    1788
2     474
3     255
Name: StockOptionLevel, dtype: int64

In [85]:
#eliminar EmployeeCount, Over18
#Desconocimiento sobre StockOptionLevel, YearsSinceLastPromotion

In [86]:
df_general = df_general.drop(['EmployeeCount', 'Over18'], axis = 1)

In [87]:
#eliminación de datos nulos de la base datos generales de los empleados, 
df_general = df_general.dropna()

In [88]:
#Cambio tipo de variable 
df_general= df_general.astype({'TotalWorkingYears' : int })
df_general= df_general.astype({'NumCompaniesWorked' : int })

In [89]:
df_general['TotalWorkingYears'].unique()

array([ 1,  6,  5, 13,  9, 28, 10, 21, 16, 37,  7,  3, 15,  8, 12, 17, 19,
       22,  2,  4, 23,  0, 11, 24, 25, 20, 14, 26, 18, 30, 36, 31, 33, 32,
       34, 40, 29, 35, 27, 38])

In [90]:
df_general.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4382 entries, 0 to 4408
Data columns (total 21 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Age                      4382 non-null   int64
 1   BusinessTravel           4382 non-null   object
 2   Department               4382 non-null   object
 3   DistanceFromHome         4382 non-null   int64
 4   Education                4382 non-null   int64
 5   EducationField           4382 non-null   object
 6   EmployeeID               4382 non-null   int64
 7   Gender                   4382 non-null   object
 8   JobLevel                 4382 non-null   int64
 9   JobRole                  4382 non-null   object
 10  MaritalStatus            4382 non-null   object
 11  MonthlyIncome            4382 non-null   int64
 12  NumCompaniesWorked       4382 non-null   int32
 13  PercentSalaryHike        4382 non-null   int64
 14  StandardHours            4382 non-null   int64
 15  StockOptionLevel         4382 non-null   int64
 16  TotalWorkingYears        4382 non-null   int32
 17  TrainingTimesLastYear    4382 non-null   int64
 18  YearsAtCompany           4382 non-null   int64
 19  YearsSinceLastPromotion  4382 non-null   int64
 20  YearsWithCurrManager     4382 non-null   int64
dtypes: int32(2), int64(13), object(6)
memory usage: 718.9+ KB

3. Modificaciones a la base de la encuesta de empleados

In [91]:
df_employee_s['EnvironmentSatisfaction'].value_counts()

3.0    1350
4.0    1334
2.0     856
1.0     845
Name: EnvironmentSatisfaction, dtype: int64

In [92]:
df_employee_s['EnvironmentSatisfaction'].value_counts()

3.0    1350
4.0    1334
2.0     856
1.0     845
Name: EnvironmentSatisfaction, dtype: int64

In [93]:
#eliminación de datos nulos 
df_employee_s = df_employee_s.dropna()

In [94]:
#Cambio tipo de variable float a int
df_employee_s= df_employee_s.astype({'EnvironmentSatisfaction' : int })
df_employee_s= df_employee_s.astype({'JobSatisfaction' : int })
df_employee_s= df_employee_s.astype({'WorkLifeBalance' : int })

4. Modificación de la base de datos de la encuesta del gerente

In [107]:
df_manager_s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4410 entries, 0 to 4409
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         4410 non-null   int64
 1   JobInvolvement     4410 non-null   int64
 2   PerformanceRating  4410 non-null   int64
dtypes: int64(3)
memory usage: 103.5 KB

Nota: no se hizo ninguna modificación debido a que no hay nulos y las variables tienen asignada una tipo de dato correcto

5. Modificación de la base de datos de los empleados retirados de la empresa

In [96]:
df_retirement.info() #existen datos nulos en la variable de razones de renuncia

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 711 entries, 0 to 710
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         711 non-null    int64
 1   Attrition          711 non-null    object
 2   retirementDate     711 non-null    object
 3   retirementType     711 non-null    object
 4   resignationReason  641 non-null    object
dtypes: int64(1), object(4)
memory usage: 27.9+ KB

In [97]:
df_retirement['resignationReason'].value_counts()

Others    323
Salary    189
Stress    129
Name: resignationReason, dtype: int64

In [98]:
#se llenan los datos nulos con una nueva categoría llamada "no information"
df_retirement['resignationReason']= df_retirement['resignationReason'].fillna('No information')

Nota: no se tendrán en cuenta las bases de datos "in_time" y "out_time" debido a que no se encontrarón relvantes para el estudio.

## Análisis exploratorio